import { BookDataType } from "~/types";

export const demoData: BookDataType[] = [
  {
    id: 1,
    slug: "tasauf-o-attoshuddhi",
    name: "তাসাওউফ ও আত্মশুদ্ধি",
    images: [
      { url: "/images/book/tasauf-o-attosuddhi.jpg" },
      { url: "/images/book/ruher-chikissha.jpeg" },
    ],
    author: "শাইখুল ইসলাম মুফতী মুহাম্মাদ তাকী উসমানী",
    currentPrice: 250,
    price: 300,
    rating: 3,
    isInStock: true,
    category: "নওমুসলিমদের জন্য",
    publication: "সমকালীন প্রকাশন",
    extraDetails:
      "পৃষ্ঠা : 192, কভার : পেপার ব্যাক, সংস্করণ : 1st Published, 2020",
    description:
      "বেলা ফুরাবার আগে…নিজেকে আবিষ্কারের একটি আয়না। যে ভুল আর ভ্রান্তির মোহে, অন্ধকারের যে অলিগলিতে আমাদের এতোদিনকার পদচারণা, তার বিপরীতে জীবনের নতুন অধ্যায়ে নিজের নাম লিখিয়ে নিতে একটি সহায়ক গ্রন্থ এই বই, ইন শা আল্লাহ।বইটি কাদের জন্য?এই বই তাদের জন্য যারা আমার কাছে ‘সাজিদ হতে চাই’ বলে বিভিন্ন সময়ে আবদার করেন। পরামর্শের আবদার, পথনির্দেশের আবদার। সাজিদ হতে হলে, আমি মনে করি, সবার আগে একটা অন্ধকার বৃত্ত থেকে আমাদের বেরিয়ে আসতে হবে। সাজিদ যেভাবে অন্ধকারের কৃষ্ণগহ্বর ছেড়ে, আলোর ফোয়ারাতে তার জীবন রাঙিয়েছে, সেরকম ঝলমলে আলোর মাঝে নিজেকে মেলে ধরাই ‘সাজিদ’ হবার প্রথম এবং প্রধান শর্ত। কেবল ভারি ভারি বই আর যুক্তির পশরা সাজিয়ে প্রতিপক্ষকে পরাস্ত করার মধ্যেই ‘সাজিদ’ হয়ে উঠার সার্থকতা নেই। সাজিদ হয়ে উঠার সার্থকতা তখনই যখন সাজিদ যে আদর্শের আলো প্রাণে প্রাণে ছড়িয়ে দিতে চায়, তা আমরা জীবনে মেখে নিতে পারবো।বইটি কাদের জন্য?ভুলোমনা একঝাঁক তারুণ্যের জন্য এই বই। যে ভুলের গহ্বরে তারা জীবনের বসন্তগুলোকে পার করছে, সেই ভুল থেকে তাদের ‘বেলা ফুরাবার আগে’ টেনে তুলতেই এই বইটার অবতারণা।এর বাইরেও থাকছেঃ ‘চোখের রোগ’, ‘বলো, সুখ কোথা পাই’, ‘বেলা ফুরাবার আগে’, ‘মেঘের কোলে রোদ হেসেছে’, ‘যুদ্ধ মানে শত্রু শত্রু খেলা’, ‘চলে যাওয়া মানে প্রস্থান নয়’, ‘বসন্ত এসে গেছে’, ‘তুলি দুই হাত করি মোনাজাত’, ‘চলো বদলাই’ নামের আঠারোটি ভিন্ন ভিন্ন বিষয়ে, ভিন্ন ভিন্ন অধ্যায়।",
  },
  {
    id: 2,
    slug: "surrenderd-wife",
    name: "সারেন্ডার্ড ওয়াইফ",
    images: [{ url: "/images/book/sarenderd-wife.jpg" }],
    author: "শাইখুল ইসলাম মুফতী মুহাম্মাদ তাকী উসমানী",
    currentPrice: 336,
    price: 480,
    rating: 4,
    isInStock: true,
    category: "ইসলামে নারী",
    publication: "সিয়ান পাবলিকেশন",
    extraDetails: "কভার : পেপার ব্যাক",
    description:
      "জন গ্রে – এর লেখা মেন আর ফ্রম মার্স, উইমেন আর ফ্রম ভিনাস বইটি পড়েছিলাম। এটা আমাকে নারী ও পুরুষের পারস্পরিক যোগাযোগ পদ্ধতির ভিন্নতা ও বৈচিত্র্য সম্পর্কে একটা ধারণা দেয়। তখন কিছুটা উপলব্ধি হয় যে, জীবন সম্পর্কে নারী ও পুরুষের ভিন্ন ভিন্ন দৃষ্টিভঙ্গিগুলোতে কতটা পার্থক্য বিদ্যমান।আমি অন্য নারীদের সঙ্গে বিষয়টি নিয়ে কথা বলি এবং বোঝার চেষ্টা করি—তাদের দাম্পত্য জীবনে সুখী হওয়ার পেছনে কোন বিষয়গুলো সবচেয়ে গুরত্বপূর্ণ ভূমিকা পালন করেছে। তখনো জানতাম না যে, এরই মাধ্যমে আমি আত্মসমর্পণের পথে হাঁটি-হাঁটি-পা-পা করে চলতে শুরু করেছি। পরে এটাই হয়েছিল আমাদের দাম্পত্য জীবনে প্রশান্তি তৈরি করা এবং আমার হারানো আত্মমর্যাদা ফিরিয়ে আনার মাধ্যম। আজ আমি একজন আত্মসমর্পণকারী স্ত্রী হিসেবে নিজের পরিচয় দিই। একজন নারী হিসেবে যেরকম দাম্পত্য জীবনের স্বপ্ন আমি দেখেছিলাম, ঠিক সেরকম একটা জীবনই পেতে শুরু করি এরপর থেকে। এই একই ব্যাপার আপনার ক্ষেত্রেও ঘটবে, যদি আপনি এ-বইয়ের মূলনীতিগুলো অনুসরণ করেন।",
  },
  {
    id: 1,
    slug: "tasauf-o-attoshuddhi",
    name: "তাসাওউফ ও আত্মশুদ্ধি",
    images: [
      { url: "/images/book/tasauf-o-attosuddhi.jpg" },
      { url: "/images/book/ruher-chikissha.jpeg" },
    ],
    author: "শাইখুল ইসলাম মুফতী মুহাম্মাদ তাকী উসমানী",
    currentPrice: 250,
    price: 300,
    rating: 3,
    isInStock: true,
    category: "নওমুসলিমদের জন্য",
    publication: "সমকালীন প্রকাশন",
    extraDetails:
      "পৃষ্ঠা : 192, কভার : পেপার ব্যাক, সংস্করণ : 1st Published, 2020",
    description:
      "বেলা ফুরাবার আগে…নিজেকে আবিষ্কারের একটি আয়না। যে ভুল আর ভ্রান্তির মোহে, অন্ধকারের যে অলিগলিতে আমাদের এতোদিনকার পদচারণা, তার বিপরীতে জীবনের নতুন অধ্যায়ে নিজের নাম লিখিয়ে নিতে একটি সহায়ক গ্রন্থ এই বই, ইন শা আল্লাহ।বইটি কাদের জন্য?এই বই তাদের জন্য যারা আমার কাছে ‘সাজিদ হতে চাই’ বলে বিভিন্ন সময়ে আবদার করেন। পরামর্শের আবদার, পথনির্দেশের আবদার। সাজিদ হতে হলে, আমি মনে করি, সবার আগে একটা অন্ধকার বৃত্ত থেকে আমাদের বেরিয়ে আসতে হবে। সাজিদ যেভাবে অন্ধকারের কৃষ্ণগহ্বর ছেড়ে, আলোর ফোয়ারাতে তার জীবন রাঙিয়েছে, সেরকম ঝলমলে আলোর মাঝে নিজেকে মেলে ধরাই ‘সাজিদ’ হবার প্রথম এবং প্রধান শর্ত। কেবল ভারি ভারি বই আর যুক্তির পশরা সাজিয়ে প্রতিপক্ষকে পরাস্ত করার মধ্যেই ‘সাজিদ’ হয়ে উঠার সার্থকতা নেই। সাজিদ হয়ে উঠার সার্থকতা তখনই যখন সাজিদ যে আদর্শের আলো প্রাণে প্রাণে ছড়িয়ে দিতে চায়, তা আমরা জীবনে মেখে নিতে পারবো।বইটি কাদের জন্য?ভুলোমনা একঝাঁক তারুণ্যের জন্য এই বই। যে ভুলের গহ্বরে তারা জীবনের বসন্তগুলোকে পার করছে, সেই ভুল থেকে তাদের ‘বেলা ফুরাবার আগে’ টেনে তুলতেই এই বইটার অবতারণা।এর বাইরেও থাকছেঃ ‘চোখের রোগ’, ‘বলো, সুখ কোথা পাই’, ‘বেলা ফুরাবার আগে’, ‘মেঘের কোলে রোদ হেসেছে’, ‘যুদ্ধ মানে শত্রু শত্রু খেলা’, ‘চলে যাওয়া মানে প্রস্থান নয়’, ‘বসন্ত এসে গেছে’, ‘তুলি দুই হাত করি মোনাজাত’, ‘চলো বদলাই’ নামের আঠারোটি ভিন্ন ভিন্ন বিষয়ে, ভিন্ন ভিন্ন অধ্যায়।",
  },
  {
    id: 2,
    slug: "surrenderd-wife",
    name: "সারেন্ডার্ড ওয়াইফ",
    images: [{ url: "/images/book/sarenderd-wife.jpg" }],
    author: "শাইখুল ইসলাম মুফতী মুহাম্মাদ তাকী উসমানী",
    currentPrice: 336,
    price: 480,
    rating: 4,
    isInStock: true,
    category: "ইসলামে নারী",
    publication: "সিয়ান পাবলিকেশন",
    extraDetails: "কভার : পেপার ব্যাক",
    description:
      "জন গ্রে – এর লেখা মেন আর ফ্রম মার্স, উইমেন আর ফ্রম ভিনাস বইটি পড়েছিলাম। এটা আমাকে নারী ও পুরুষের পারস্পরিক যোগাযোগ পদ্ধতির ভিন্নতা ও বৈচিত্র্য সম্পর্কে একটা ধারণা দেয়। তখন কিছুটা উপলব্ধি হয় যে, জীবন সম্পর্কে নারী ও পুরুষের ভিন্ন ভিন্ন দৃষ্টিভঙ্গিগুলোতে কতটা পার্থক্য বিদ্যমান।আমি অন্য নারীদের সঙ্গে বিষয়টি নিয়ে কথা বলি এবং বোঝার চেষ্টা করি—তাদের দাম্পত্য জীবনে সুখী হওয়ার পেছনে কোন বিষয়গুলো সবচেয়ে গুরত্বপূর্ণ ভূমিকা পালন করেছে। তখনো জানতাম না যে, এরই মাধ্যমে আমি আত্মসমর্পণের পথে হাঁটি-হাঁটি-পা-পা করে চলতে শুরু করেছি। পরে এটাই হয়েছিল আমাদের দাম্পত্য জীবনে প্রশান্তি তৈরি করা এবং আমার হারানো আত্মমর্যাদা ফিরিয়ে আনার মাধ্যম। আজ আমি একজন আত্মসমর্পণকারী স্ত্রী হিসেবে নিজের পরিচয় দিই। একজন নারী হিসেবে যেরকম দাম্পত্য জীবনের স্বপ্ন আমি দেখেছিলাম, ঠিক সেরকম একটা জীবনই পেতে শুরু করি এরপর থেকে। এই একই ব্যাপার আপনার ক্ষেত্রেও ঘটবে, যদি আপনি এ-বইয়ের মূলনীতিগুলো অনুসরণ করেন।",
  },
];
